matepeter90/xively-client-c/examples/cc3200/xively_demo/main.c
/* Copyright (c) 2003-2016, LogMeIn, Inc. All rights reserved.
 *
 * This is part of the Xively C Client library,
 * it is licensed under the BSD 3-Clause license.
 */

//*****************************************************************************
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

// Simplelink includes
#include "simplelink.h"

// Driverlib includes
#include "hw_gpio.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_types.h"
#include "interrupt.h"
#include "pin.h"
#include "prcm.h"
#include "rom.h"
#include "rom_map.h"
#include "utils.h"
#include "gpio.h"

// Common interface includes
#include "button_if.h"
#include "common.h"
#include "gpio_if.h"
#include "i2c_if.h"
#include "pinmux.h"
#include "tmp006drv.h"

//Ringbuffer for temperature
#include "ringbuffer.h"

// required by sprintf
#include <stdio.h>

#ifndef NOTERM
#include "uart_if.h"
#endif

#define XIVELY_DEMO_PRINT( ... )                                                         \
    UART_PRINT( __VA_ARGS__ );                                                           \
    printf( __VA_ARGS__ );

/*****************************************************************************
 *                              Defines
 *****************************************************************************/
#define APPLICATION_NAME "XIVELY_CC3200_DEMO_APP"
#define APPLICATION_VERSION "0.0.1"
#define SUCCESS 0

#define XIVELY_CRED_LEN_MAX ( 64 )
#define WIFI_KEY_LEN_MAX ( 64 )
#define XIVELY_CRED_LEN_MAX ( 64 )

/* Path to load the configuration file from device's flash file system.
 * This config file contains Xively connection credentials and WiFi SSID
 * and password credentials */
#define XIVELY_CFG_FILE "/etc/xively_cfg.txt"

/* Some defaults for the optional connection address configuration values */
#define XIVELY_DEFAULT_BROKER "broker.xively.eu"
#define XIVELY_DEFAULT_PORT ( 8883 )

/* Xively Configuration File Key Names. These will be used to lookup key/value pairs
 * for Xively credentials and WiFI credentials from a file stored in the device's
 * flash file system */
#define WIFI_SEC_TYPE_KEY "wifi_security_type"
#define WIFI_SSID_KEY "wifi_ssid"
#define WIFI_PASSWORD_KEY "wifi_password"
#define XIVELY_HOST_KEY "hostname"
#define XIVELY_PORT_KEY "port"
#define XIVELY_ACNT_KEY "account_id"
#define XIVELY_DEV_KEY "device_id"
#define XIVELY_PWD_KEY "password"

/* Used to detect if the user has configured their xively_cfg.txt file
 * on the device before the execution of the application */
#define XIVELY_DEFAULT_CONFIG_FIELD_VALUE "PASTE_XIVELY_CREDENTIAL_HERE"
#define WIFI_DEFAULT_CONFIG_FIELD_VALUE "ENTER_WIFI_CREDENTIAL_HERE"

#define ENABLE_XIVELY_FIRMWARE_UPDATE_AND_SECURE_FILE_TRANSFER 1

/* String template for dynamically constructing the various Xively topics
 * that are used for this application. */
#define XIVELY_TOPIC_LEN ( 128 )
#define XIVELY_TOPIC_FORMAT "xi/blue/v1/%s/d/%s/%s"

// Application specific status/error codes
typedef enum {
    // Choosing -0x7D0 to avoid overlap w/ host-driver's error codes
    LAN_CONNECTION_FAILED      = -0x7D0,
    DEVICE_NOT_IN_STATION_MODE = LAN_CONNECTION_FAILED - 1,
    STATUS_CODE_MAX            = -0xBB8
} e_AppStatusCodes;

/* WiFi and Xively Credentials are stored here after being parsed
 * from configuration file in FFS. */
typedef struct WifiDeviceCredentials_s
{
    int desiredWifiSecurityType;               /* see SL_WLAN_SEC_TYPE in wlan.h */
    char desiredWifiSSID[SSID_LEN_MAX + 1];    /* user configured host wifi SSID */
    char desiredWifiKey[WIFI_KEY_LEN_MAX + 1]; /* user configured wifi password */
    char xivelyAccountId[XIVELY_CRED_LEN_MAX];
    char xivelyDeviceId[XIVELY_CRED_LEN_MAX];
    char xivelyDevicePassword[XIVELY_CRED_LEN_MAX];
} WifiDeviceCredentials_t;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile unsigned long g_ulStatus = 0;              // SimpleLink Status
unsigned long g_ulGatewayIP       = 0;              // Network Gateway IP address
unsigned char g_ucConnectionSSID[SSID_LEN_MAX + 1]; // Connection SSID
unsigned char g_ucConnectionBSSID[BSSID_LEN_MAX];   // Connection BSSID
ring_buffer_t g_rbTempBuffer;

/* Struct which stores device configuration for desired WiFi connection parameters and
 * for Xively connection parameters. */
WifiDeviceCredentials_t g_wifi_device_credentials;

