matepeter90/xively-client-c/examples/cc3200/xively_demo/main.c
#if defined( ccs )
extern void ( *const g_pfnVectors[] )( void );
#endif
#if defined( ewarm )
extern uVectorEntry __vector_table;
#endif
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************

//****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//****************************************************************************
long MainLogic();
static void BoardInit( void );
static void InitializeAppVariables();
void ConnectToXively();
void WaitForWlanEvent();

/******************************************************************************/
/* BEGINNING OF XIVELY CODE */
/******************************************************************************/

/* Includes used by the code below. */
#include <time.h>
#include <xi_bsp_rng.h>
#include <xi_bsp_time.h>
#include <xively.h>
#include "config_file.h"

/******************************************************************************/
/* BEGINNING OF XIVELY CODE GLOBAL SECTION */
/******************************************************************************/

/* Names of the MQTT topics used by this application */
const char* const gTemperatureTopicName = "temp";
const char* const gGreenLedTopicName = "Green LED";
const char* const gOrangeLedTopicName = "Orange LED";
const char* const gRedLedTopicName = "Red LED";
const char* const gButtonSW2TopicName = "Button SW2";
const char* const gButtonSW3TopicName = "Button SW3";

/* Required by push button interrupt handlers - there is no space for user argument so we
 * can't pass the xively's context handler as a function argument. */
xi_context_handle_t gXivelyContextHandle = -1;

/* Used to store the temperature timed task handles. */
xi_timed_task_handle_t gMeasureTemperatureTaskHandle = -1;
xi_timed_task_handle_t gSendTemperatureTaskHandle = -1;

/* Used by onLed handler function to differentiate LED's */
const static ledNames gGreenLed  = MCU_GREEN_LED_GPIO;
const static ledNames gOrangeLed = MCU_ORANGE_LED_GPIO;
const static ledNames gRedLed    = MCU_RED_LED_GPIO;

/******************************************************************************/
/* END OF XIVELY CODE GLOBAL SECTION */
/******************************************************************************/

/*
 * @brief Subscribes to a topic given a channel (topic suffix) and a callback.
 * See xively.h for full signature information of callbacks.
 *
 * @param in_context_handle the Xively connection context as was returned from
 * xi_create_context, and passed in from the connection callback on_connected().
 * This value must be used in all further Xively operations, including subscription
 * requests (below.)
 * @param channel a string to append to the end of the topic base string.  General
 * topic structure is:  xi/blue/v1/{accountId}/d/{deviceId}/{channel}.
 * @param callback a pointer to the callback function that handles subscription
 * status updates and incoming messages on the topic.  For this example application
 * this is on_blink_topic as specified in the invocation of this function in
 * on_connected() (above.)
 * @param user_data an abstract data pointer that can be anything, and will be
 * passed to the subscription handler on all invocations.  In this case the GPIO
 * index of the corresponding LED is provided. We use this to easily associate a topic
 * with an LED, without having to parse the full topic name.
 * @retval xi_state_t which is the success / failure code of the xi_subscription request.
 * Since the actual subscription response from the service occurs asynchronously, this
 * value represents if the subscription request was properly queued by the Xively Client,
 * and does not reflect the SUBACK value of the subscription request itself.
 */
xi_state_t subscribe_to_topic( xi_context_handle_t context_handle,
                               const char* channel,
                               xi_user_subscription_callback_t* callback,
                               void* user_data )
{
    char topic_name[XIVELY_TOPIC_LEN];
    memset( topic_name, '\0', XIVELY_TOPIC_LEN );

    snprintf( topic_name, XIVELY_TOPIC_LEN, XIVELY_TOPIC_FORMAT,
              g_wifi_device_credentials.xivelyAccountId,
              g_wifi_device_credentials.xivelyDeviceId, channel );

    return xi_subscribe( context_handle, topic_name, XI_MQTT_QOS_AT_MOST_ONCE, callback,
                         user_data );
}

xi_state_t publish_to_topic( xi_context_handle_t context_handle,
                               const char* channel,
                               void* msg )
{
    char topic_name[XIVELY_TOPIC_LEN];
    memset( topic_name, '\0', XIVELY_TOPIC_LEN );

    snprintf( topic_name, XIVELY_TOPIC_LEN, XIVELY_TOPIC_FORMAT,
              g_wifi_device_credentials.xivelyAccountId,
              g_wifi_device_credentials.xivelyDeviceId, channel );

    return xi_publish( context_handle, topic_name, msg, XI_MQTT_QOS_AT_MOST_ONCE,
                       XI_MQTT_RETAIN_FALSE, NULL, NULL );
}

/**
* @brief Event handler for SW2 button press/release interrupts.
 *
 * The pinValue will be 1 on a button press event, 0 on button up..
 */
void pushButtonInterruptHandlerSW2()
{
    int pinValue = GPIOPinRead( GPIOA2_BASE, GPIO_PIN_6 );
    if ( pinValue == 0 )
    {
        publish_to_topic( gXivelyContextHandle, gButtonSW2TopicName, "0");
    }
    else
    {
        publish_to_topic( gXivelyContextHandle, gButtonSW2TopicName, "1");
    }

    Button_IF_EnableInterrupt( SW2 );
}

/**
 * @brief Event handler for SW2 button press/release interrupts.
 *
 * The pinValue will be 1 on a button press event, 0 on button up.
 */
void pushButtonInterruptHandlerSW3()
{
    int pinValue = GPIOPinRead( GPIOA1_BASE, GPIO_PIN_5 );

    if ( pinValue == 0 )
    {
        publish_to_topic( gXivelyContextHandle, gButtonSW3TopicName, "0");
    }
    else
    {
        publish_to_topic( gXivelyContextHandle, gButtonSW3TopicName, "1");
    }

    Button_IF_EnableInterrupt( SW3 );
}

/**
 * @brief Function that handles messages sent to the device on the LEDs' topics,
 * including toggle commands and subscription changes.
 *
 * @note For more details please refer to the xively.h - xi_subscribe function.
 *
 * @param in_context_handle - xively library context required for calling API functions
 * @param call_type - describes if the handler was called carrying the subscription
 * operation result or the incoming message
 * @oaram params - structure with data
 * @param state - state of the operation
 * @oaram user_data - Pointer provided upon LedTopic subscription. For this application's
 * use, these are the LED names.
 */
void onLedTopic( xi_context_handle_t in_context_handle,
                 xi_sub_call_type_t call_type,
                 const xi_sub_call_params_t* const params,
                 xi_state_t state,
                 void* user_data )
{
    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                XIVELY_DEMO_PRINT( "topic:%s. Subscription failed.\n",
                                   params->suback.topic );
            }
            else
            {
                XIVELY_DEMO_PRINT( "topic:%s. Subscription granted %d.\n",
                                   params->suback.topic,
                                   ( int )params->suback.suback_status );
            }
            return;
        case XI_SUB_CALL_MESSAGE:
            if ( params->message.temporary_payload_data_length == 1 )
            {
                ledNames ledName = *( ( ledNames* )user_data );

                switch ( params->message.temporary_payload_data[0] )
                {
                    case 48:
                        GPIO_IF_LedOff( ledName );
                        break;
                    case 49:
                        GPIO_IF_LedOn( ledName );
                        break;
                    default:
                        XIVELY_DEMO_PRINT( "unexpected value on topic %s \n",
                                           params->message.topic );
                        break;
                }
            }
            else
            {
                XIVELY_DEMO_PRINT( "unexpected data length on topic %s \n",
                                   params->message.topic );
            }
            return;
        default:
            return;
    }
}

/**
 * @brief Recurring time task that temporarily activates the device's temperature sensor,
 * measures the result on the temperature topic for the device, an then re-enables LED
 * control.
 *
 * @note for more details about user time tasks please refer to the xively.h -
 * xi_schedule_timed_task function.
 */
void measure_temperature()
{
    /* Prepare configuration for temperature sensor for I2C bus */
    PinTypeI2C( PIN_01, PIN_MODE_1 );
    PinTypeI2C( PIN_02, PIN_MODE_1 );

    int lRetVal        = -1;
    float fCurrentTemp = .0f;

    /* I2C Init */
    lRetVal = I2C_IF_Open( I2C_MASTER_MODE_FST );
    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
        goto end;
    }

    /* Init Temperature Sensor */
    lRetVal = TMP006DrvOpen();
    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
        goto end;
    }

    TMP006DrvGetTemp( &fCurrentTemp );

    ring_buffer_queue(&g_rbTempBuffer, fCurrentTemp);

    do
    {
    } while ( I2C_IF_Close() != 0 );

end:
    /* Restore configuration for LED control */
    PinTypeGPIO( PIN_01, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT );

    PinTypeGPIO( PIN_02, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT );
}

/**
 * @brief Recurring time task that temporarily activates the device's temperature sensor,
 * publishes the result on the temperature topic for the device, an then re-enables LED
 * control.
 *
 * @note for more details about user time tasks please refer to the xively.h -
 * xi_schedule_timed_task function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param timed_task_handle - handle to *this* timed task, can be used to re-schedule or
 * cancel the task
 * @param user_data - data assosicated with this timed task
 */
void send_temperature( const xi_context_handle_t context_handle,
                       const xi_timed_task_handle_t timed_task_handle,
                       void* user_data )
{
    char msg[16]       = {'\0'};

    if(ring_buffer_is_full(&g_rbTempBuffer)) {
        sprintf( ( char* )&msg, ",temp,%5.02f,", ring_buffer_get_average(&g_rbTempBuffer));
        publish_to_topic(context_handle, gTemperatureTopicName, msg);
    }
}

/**
 * @brief Handler function for eventa related to changes in connection state.
 *
 * @note for more details please refer to xively.h - xi_connect function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param data - points to the structure that holds detailed information about the
 * connection state and settings
 * @param state - additional internal state of the library helps to determine the reason
 * of connection failure or disconnection
 */
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state )
{
    xi_connection_data_t* conn_data = ( xi_connection_data_t* )data;

    switch ( conn_data->connection_state )
    {
        case XI_CONNECTION_STATE_OPEN_FAILED:
            XIVELY_DEMO_PRINT( "connection to %s:%d has failed reason %d\n",
                               conn_data->host, conn_data->port, state );

            xi_connect( in_context_handle, conn_data->username, conn_data->password,
                        conn_data->connection_timeout, conn_data->keepalive_timeout,
                        conn_data->session_type, &on_connected );

            return;
        case XI_CONNECTION_STATE_OPENED:
            XIVELY_DEMO_PRINT( "connected to %s:%d\n", conn_data->host, conn_data->port );

