matepeter90/xively-client-c/examples/cc3200/xively_demo/main.c
            /* register a function to measure temperature data every 10 seconds */
            gMeasureTemperatureTaskHandle =
                xi_schedule_timed_task( in_context_handle, measure_temperature, 10, 1, NULL );

            if ( XI_INVALID_TIMED_TASK_HANDLE == gMeasureTemperatureTaskHandle )
            {
                XIVELY_DEMO_PRINT( "measure_temperature_task couldn't be registered\n" );
            }

            /* register a function to send temperature data every 30 seconds */
            gSendTemperatureTaskHandle =
                xi_schedule_timed_task( in_context_handle, send_temperature, 30, 1, NULL );

            if ( XI_INVALID_TIMED_TASK_HANDLE == gSendTemperatureTaskHandle )
            {
                XIVELY_DEMO_PRINT( "send_temperature_task couldn't be registered\n" );
            }

            /* subscribe to LED topics to listen for light toggle commands */
            subscribe_to_topic( in_context_handle, gGreenLedTopicName, onLedTopic, ( void* )&gGreenLed );
            subscribe_to_topic( in_context_handle, gOrangeLedTopicName, onLedTopic, ( void* )&gOrangeLed );
            subscribe_to_topic( in_context_handle, gRedLedTopicName, onLedTopic, ( void* )&gRedLed );

            /* enable the button interrupts */
            Button_IF_EnableInterrupt( SW2 | SW3 );

            break;
        case XI_CONNECTION_STATE_CLOSED:
            XIVELY_DEMO_PRINT( "connection closed - reason %d!\n", state );

            /* cancel timed task - we don't want to send messages while the library not
             * connected */
            xi_cancel_timed_task( gSendTemperatureTaskHandle );
            gSendTemperatureTaskHandle = XI_INVALID_TIMED_TASK_HANDLE;
            xi_cancel_timed_task( gMeasureTemperatureTaskHandle );
            gMeasureTemperatureTaskHandle = XI_INVALID_TIMED_TASK_HANDLE;

            /* disable button interrupts so the messages for button push/release events
             * won't be sent */
            Button_IF_DisableInterrupt( SW2 | SW3 );

            /* check if the close was due to the user's request */
            if ( XI_STATE_OK == state )
            {
                xi_events_stop();
            }
            else
            {
                WaitForWlanEvent();

                xi_connect( in_context_handle, conn_data->username, conn_data->password,
                            conn_data->connection_timeout, conn_data->keepalive_timeout,
                            conn_data->session_type, &on_connected );
            }
            return;
        default:
            XIVELY_DEMO_PRINT( "invalid parameter %d\n", conn_data->connection_state );
            return;
    }
}

/**
 * @brief Driver for the xively library logic
 *
 * This function initialises the library, creates a context and starts the internal event
 * dispatcher and event processing of xively library.
 *
 * This function is blocking for the sakness of this demo application however it is
 * possible to run xively's event processing with limit of iterations.
 */
void ConnectToXively()
{
    /* Register Push Button Handlers */
    Button_IF_Init( pushButtonInterruptHandlerSW2, pushButtonInterruptHandlerSW3 );

    /* Make the buttons to react on both press and release events */
    MAP_GPIOIntTypeSet( GPIOA1_BASE, GPIO_PIN_5, GPIO_BOTH_EDGES );
    MAP_GPIOIntTypeSet( GPIOA2_BASE, GPIO_PIN_6, GPIO_BOTH_EDGES );

    /* Disable the interrupt for now */
    Button_IF_DisableInterrupt( SW2 | SW3 );

    xi_state_t ret_state = xi_initialize( g_wifi_device_credentials.xivelyAccountId,
                                          g_wifi_device_credentials.xivelyDeviceId );

    if ( XI_STATE_OK != ret_state )
    {
        XIVELY_DEMO_PRINT( "xi failed to initialise\n" );
        return;
    }

    gXivelyContextHandle = xi_create_context();

    if ( XI_INVALID_CONTEXT_HANDLE == gXivelyContextHandle )
    {
        XIVELY_DEMO_PRINT( " xi failed to create context, error: %d\n",
                           -gXivelyContextHandle );
        return;
    }

#if ENABLE_XIVELY_FIRMWARE_UPDATE_AND_SECURE_FILE_TRANSFER
    /* Pass list of files to be updated by the Xively Services. */
    const char** files_to_keep_updated =
        ( const char* [] ){"firmware.bin", "credentials.cfg"};

    xi_set_updateable_files( gXivelyContextHandle, files_to_keep_updated, 2, NULL );
#endif

    xi_state_t connect_result =
            xi_connect( gXivelyContextHandle, g_wifi_device_credentials.xivelyDeviceId,
                        g_wifi_device_credentials.xivelyDevicePassword, 10, 0,
                        XI_SESSION_CLEAN, &on_connected );

    /* start processing xively library events */
    xi_events_process_blocking();

    /* when the event dispatcher is stop destroy the context */
    xi_delete_context( gXivelyContextHandle );

    /* shutdown the xively library */
    xi_shutdown();
}

/**
 * @brief Function that is required by TLS library to track the current time.
 */
time_t XTIME( time_t* timer )
{
    return xi_bsp_time_getcurrenttime_seconds();
}

/**
 * @brief Function required by the TLS library.
 */
uint32_t xively_ssl_rand_generate()
{
    return xi_bsp_rng_get();
}

/* @brief helper function that uses the config_file parser to parse a value for the
 * provided key.
 *
 * @param config_file_context this value returned from the creation of the config_file
 * parser.
 * This context is required for all config_file operations.
 * @param key a string to use as a lookup key for the key/value pairs in the config file.
 * @param is_required when set to a non-zero value, an error will be logged to the console
 * if the
 * specified key could not be found in the configuration file.  This does not effect the
 * return value
 * of this function.
 * @retval 0 on successful parse of parameter. -1 if parameter does not exist in the
 * configuration file,
 * or if another error has occurred.
 */
int8_t parseKeyValue( config_entry_t* config_file_context,
                      const char* key,
                      const uint8_t is_required,
                      char** out_value )
{
    int8_t retVal = 0;
    if ( NULL == out_value )
    {
        printf( "parseRequiredKeyValue error: out_value parameter is NULL!\n\r" );
        retVal = -1;
    }
    else if ( NULL == key )
    {
        printf( "parseRequiredKeyValue error: in_key parameter is NULL!\n\r" );
        retVal = -1;
    }
    else
    {
        *out_value = get_config_value( config_file_context, key );
        if ( NULL == *out_value )
        {
            retVal = -1;
            if ( is_required )
            {
                printf( "Could not find an entry for \"%s\" key in configuration file\n",
                        key );
            }
        }
    }

    return retVal;
}

/* @brief Attempts to match the string from the configuration file to an enumeration
 * the platform's SDK wlan.h file.  The most common LAN types are supported
 * out of the box. The more uncommong lans haven't been tested again
 * but in theory could be enabled.
 * @retval one of the SL_WLAN_SEC_TYPE values as defined in wlan.h, or
 * -1 if the mapping failed.
 */
int8_t mapWifiSecurityTypeStringToInt( const char* security_type )
{
    if ( NULL == security_type )
    {
        printf( "Now Wifi Security Type String found in configuration file!\n\r" );
        return -1;
    }

    if ( strcmp( "open", security_type ) == 0 || strcmp( "OPEN", security_type ) == 0 )
    {
        return SL_SEC_TYPE_OPEN;
    }

    if ( strcmp( "wep", security_type ) == 0 || strcmp( "WEP", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WEP;
    }

