matepeter90/xively-client-c/examples/cc3200/xively_demo/main.c
    if ( strcmp( "wpa", security_type ) == 0 || strcmp( "WPA", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WPA;
    }

    if ( strcmp( "wpa2", security_type ) == 0 || strcmp( "WPA2", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WPA_WPA2;
    }

    if ( strcmp( "wpa_ent", security_type ) == 0 ||
         strcmp( "WPA_ENT", security_type ) == 0 )
    {
        return SL_SEC_TYPE_WPA_ENT;
    }

    /* potential future support based on CC3220 SDK:
     *
     * SL_SEC_TYPE_WPS_PBC
     * SL_SEC_TYPE_WPS_PIN
     * SL_SEC_TYPE_P2P_PBC
     * SL_SEC_TYPE_P2P_PIN_KEYPAD
     * SL_SEC_TYPE_P2P_PIN_DISPLAY
     * SL_SEC_TYPE_P2P_PIN_AUTO
     */
    printf( "Unsupported Wifi security type: \"%s\"\n\r", security_type );
    return -1;
}

/* @brief helper function. checks to if wifi credentials are of the right size
 * and type to match simplielink API
 *
 * @param wifi_ssid The wifi network name.
 * @param wifi_ssid The wifi password
 * @param wifi_ssid a string that represents the suffix of one of the valid
 * simplelink enumerated types. For instance "wpa" would be mapped to
 * SL_WLAN_SEC_TYPE_WPA.  This check is done in mapWifiSecurityTypeStringToInt().
 * @retval 0 if parameters are valid, -1 otherwise.
 */
int8_t validateWifiConfigurationVariables( const char* wifi_ssid,
                                           const char* wifi_password,
                                           const char* wifi_security_type )
{
    int8_t retVal = 0;

    /* SSID / wifi name checks */
    if ( strlen( wifi_ssid ) > SSID_LEN_MAX )
    {
        retVal = -1;
        printf( ". \"%s\" string is too long for CC3220 wifi configuration: \"%s\"\n\r",
                WIFI_SSID_KEY, wifi_ssid );
        printf( ". Max String Length is: %d\n\r", SSID_LEN_MAX );
    }

    /* wifi password checks */
    if ( strlen( wifi_password ) > WIFI_KEY_LEN_MAX )
    {
        retVal = -1;
        printf( ". Value for \"%s\" string is too big: \"%s\"\n\r", WIFI_SSID_KEY,
                wifi_password );
        printf( ". Please reconfigure WIFI_KEY_LEN_MAX in xively_example.h to increase "
                "the buffer size\n\r" );
        printf( ". Max String Length is: %d\n\r", WIFI_KEY_LEN_MAX );
    }

    /* Security type enum checks */
    int8_t wifi_security_type_enum =
        mapWifiSecurityTypeStringToInt( ( const char* )wifi_security_type );
    if ( wifi_security_type < 0 )
    {
        retVal = -1;
        printf( ". Could not find valid \"%s\" ", WIFI_SEC_TYPE_KEY );
        printf( " in xively configuration file \"%s\"\n\r", XIVELY_CFG_FILE );
    }

    if ( 0 == strcmp( wifi_ssid, WIFI_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        retVal = -1;
        printf( ". Default WiFi SSID field entry found.\n\r" );
        printf( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
    }

    if ( 0 == strcmp( wifi_password, WIFI_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        retVal = -1;
        printf( ". Default WiFi Password field entry found.\n\r" );
        printf( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
    }

    return retVal;
}

/* @brief helper function. checks to if key's value string will fit into our Application
 * Control Block
 *
 * @param config_key the key string that was used to lookup the value in the config file.
 * This is only used for logging purposes.
 * @param value the value string that will be stored as a Xively Credential.  This
 * function
 * checks to make sure that the value will fit in the Application Control Blocks buffers
 * for Xively Credentials before a copy is made.
 * @retval 0 if the credentials are of a valid size, -1 otherwise.
 * */
int8_t validateXivelyCredentialBufferRequirement( const char* const config_key,
                                                  const char* value )
{
    if ( NULL == value )
    {
        printf( ". Key \"%s\" is missing a value in the configuration file: \"%s\"\n\r",
                config_key, value );
        return -1;
    }

    if ( 0 == strcmp( value, XIVELY_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        printf( ". \"%s\" value's is still the default value.\n\r", config_key );
        printf( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
        return -1;
    }

    if ( strlen( value ) > XIVELY_CRED_LEN_MAX )
    {
        printf( ". \"%s\" value's string is too long for internal buffer configuration. "
                "value is: \"%s\"\n\r",
                config_key, value );
        printf( ". Max String Length is: %d\n\r", XIVELY_CRED_LEN_MAX );
        return -1;
    }

    return 0;
}

/* @brief Retrieves Wifi Credential and Xively Credential information from a configuration
 * file stored on the Flash File System of the device.
 *
 * Invokes the configuration file parser in config_file.h / config_file.c for file
 * operations and for parsing the key value pairs.
 *
 * Ensures that all required credentials exist in the file and that they fit into the
 * Application control block buffers.  Additionally the wifi security
 * type is mapped to an existing CC3220 Simple Link Enumeration.
 *
 * If any validation fails then this function logs an error to the console
 * and loops forever, since any configuration error will prevent the application
 * from connecting to wifi and/or the xively service.
 */
void parseCredentialsFromConfigFile()
{
    config_entry_t* config_file_context;
    int err = read_config_file( XIVELY_CFG_FILE, &config_file_context );
    if ( err )
    {
        printf( ". Reading %s config file failed. returned %d\n\r", XIVELY_CFG_FILE,
                err );
        if ( SL_FS_ERR_FILE_NOT_EXISTS == err )
        {
            Report( ". File does not exist on flash file system.\n\r" );
        }
        Report( ". Cannot recover from error.\n\r" );
        Report( ". Looping forever.\n\r" );
        while ( 1 )
            ;
    }

    /* parse wifi credentials from config file */
    static char *wifi_ssid = NULL, *wifi_security_type = NULL, *wifi_password = NULL;

    err |= parseKeyValue( config_file_context, WIFI_SSID_KEY, 1, &wifi_ssid );
    err |=
        parseKeyValue( config_file_context, WIFI_SEC_TYPE_KEY, 1, &wifi_security_type );
    err |= parseKeyValue( config_file_context, WIFI_PASSWORD_KEY, 1, &wifi_password );

