matepeter90/xively-client-c/examples/cc3200/xively_demo/main.c
    /* parse Xively account & device credentials from config file */
    static char *xively_account_id = NULL, *xively_device_id = NULL,
                *xively_device_password = NULL;
    err |= parseKeyValue( config_file_context, XIVELY_ACNT_KEY, 1, &xively_account_id );
    err |= parseKeyValue( config_file_context, XIVELY_DEV_KEY, 1, &xively_device_id );
    err |=
        parseKeyValue( config_file_context, XIVELY_PWD_KEY, 1, &xively_device_password );

    /* optional - parse xively broker address and port from config file */
    static char *broker_name = NULL, *broker_port_str = NULL;
    if ( 0 != parseKeyValue( config_file_context, XIVELY_HOST_KEY, 0, &broker_name ) )
    {
        broker_name = XIVELY_DEFAULT_BROKER;
    }

    if ( 0 == parseKeyValue( config_file_context, XIVELY_PORT_KEY, 0, &broker_port_str ) )
    {
        if ( 0 == ( atoi( broker_port_str ) ) )
        {
            printf( ". \"%s\" value \"%s\" is an invalid \"port\" value\n",
                    XIVELY_PORT_KEY, broker_port_str );
            err = -1;
        }
    }

    /* if everything is ok so far then do some sanity checks on the string sizes and the
     * parsed values. */
    if ( !err )
    {
        err |= validateWifiConfigurationVariables( wifi_ssid, wifi_password,
                                                   wifi_security_type );

        err |= validateXivelyCredentialBufferRequirement( XIVELY_ACNT_KEY,
                                                          xively_account_id );
        err |=
            validateXivelyCredentialBufferRequirement( XIVELY_DEV_KEY, xively_device_id );
        err |= validateXivelyCredentialBufferRequirement( XIVELY_PWD_KEY,
                                                          xively_device_password );
    }

    /* one last check before we start copying memory around */
    if ( err )
    {
        printf( "\n\rCritical configuration error(s) found when parsing configuration "
                "file\n\r" );
        printf( "Looping forever.\n\r" );
        while ( 1 )
            ;
    }

    /* assign the variables into the Application Control Block. */
    g_wifi_device_credentials.desiredWifiSecurityType =
        mapWifiSecurityTypeStringToInt( ( const char* )wifi_security_type );

    memcpy( g_wifi_device_credentials.desiredWifiSSID, wifi_ssid, strlen( wifi_ssid ) );
    memcpy( g_wifi_device_credentials.desiredWifiKey, wifi_password,
            strlen( wifi_password ) );
    memcpy( g_wifi_device_credentials.xivelyAccountId, xively_account_id,
            strlen( xively_account_id ) );
    memcpy( g_wifi_device_credentials.xivelyDeviceId, xively_device_id,
            strlen( xively_device_id ) );
    memcpy( g_wifi_device_credentials.xivelyDevicePassword, xively_device_password,
            strlen( xively_device_password ) );

    free_config_entries( config_file_context );
}

/******************************************************************************/
/* END OF XIVELY CODE */
/******************************************************************************/

//*****************************************************************************
// These functions are from the ent_wlan example of the CC3200 SDK. They exist in this
// project to facilitate state tracking of the WiFi connection for the device and are not
// Xively specific.
//
// If you would like more information and documentation on these functions, please see the
// source code in the directory example/ent_wlan of your CC3200 SDK installation.
//*****************************************************************************

void SimpleLinkWlanEventHandler( SlWlanEvent_t* pWlanEvent )
{
    if ( !pWlanEvent )
    {
        return;
    }

    switch ( pWlanEvent->Event )
    {
        case SL_WLAN_CONNECT_EVENT:
        {
            SET_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );

            // Copy new connection SSID and BSSID to global parameters
            memcpy( g_ucConnectionSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_name,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_len );
            memcpy( g_ucConnectionBSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.bssid,
                    SL_BSSID_LENGTH );

            XIVELY_DEMO_PRINT( "[WLAN EVENT] STA Connected to the AP: %s , "
                               "BSSID: %x:%x:%x:%x:%x:%x\n",
                               g_ucConnectionSSID, g_ucConnectionBSSID[0],
                               g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                               g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                               g_ucConnectionBSSID[5] );
        }
        break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            slWlanConnectAsyncResponse_t* pEventData = NULL;

            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );
            CLR_STATUS_BIT( g_ulStatus, STATUS_BIT_IP_AQUIRED );

            pEventData = &pWlanEvent->EventData.STAandP2PModeDisconnected;

            // If the user has initiated 'Disconnect' request,
            //'reason_code' is SL_WLAN_DISCONNECT_USER_INITIATED_DISCONNECTION
            if ( SL_USER_INITIATED_DISCONNECTION == pEventData->reason_code )
            {
                XIVELY_DEMO_PRINT( "[WLAN EVENT]Device disconnected from the AP: %s, "
                                   "BSSID: %x:%x:%x:%x:%x:%x on application's request \n",
                                   g_ucConnectionSSID, g_ucConnectionBSSID[0],
                                   g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                                   g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                                   g_ucConnectionBSSID[5] );
            }
            else
            {
                XIVELY_DEMO_PRINT( "[WLAN ERROR]Device disconnected from the AP AP: %s,"
                                   "BSSID: %x:%x:%x:%x:%x:%x on an ERROR..!! \n",
                                   g_ucConnectionSSID, g_ucConnectionBSSID[0],
                                   g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                                   g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                                   g_ucConnectionBSSID[5] );
            }
            memset( g_ucConnectionSSID, 0, sizeof( g_ucConnectionSSID ) );
            memset( g_ucConnectionBSSID, 0, sizeof( g_ucConnectionBSSID ) );
        }
        break;

        default:
        {
            XIVELY_DEMO_PRINT( "[WLAN EVENT] Unexpected event [0x%x]\n",
                               pWlanEvent->Event );
        }
        break;
    }
}

void SimpleLinkNetAppEventHandler( SlNetAppEvent_t* pNetAppEvent )
{
    if ( !pNetAppEvent )
    {
        return;
    }

    switch ( pNetAppEvent->Event )
    {
        case SL_NETAPP_IPV4_IPACQUIRED_EVENT:
        {
            SlIpV4AcquiredAsync_t* pEventData = NULL;

